Repository: cran/dplR
Catalog: po/*.po
Languages: fi

source: Could not open file %s for reading
fi: Ei voitu avata tiedostoa %s luettavaksi

source: Number of comments exceeds integer range
fi: Kommenttien lukumäärä ylittää kokonaislukualueen

source: Number of series exceeds integer range
fi: Sarjojen lukumäärä ylittää kokonaislukualueen

source: Series %d: Header line is too long (max length %d)
fi: Sarja %d: Otsakerivi on liian pitkä (maksimipituus %d)

source: Series %d: No '=' found when header line was expected
fi: Sarja %d: Ei ’=’-merkkiä oletetulla otsakerivillä

source: Series %d: No room for number before first '='
fi: Sarja %d: Ei tilaa luvulle ennen ensimmäistä ’=’-merkkiä

source: Series %d: Only a number must be found right before 1st '='
fi: Sarja %d: Juuri ennen ensimmäistä ’=’-merkkiä täytyy olla luku, ei muuta

source: Series %d: Number %lld exceeds integer range
fi: Sarja %d: Luku %lld ylittää kokonaislukualueen

source: Series %d: Length of series must be at least one (%ld seen)
fi: Sarja %d: Sarjan pituuden täytyy olla vähintään yksi (%ld nähty)

source: Series %d: Unknown field id: %c
fi: Sarja %d: Tuntematon kentän tunniste: %c

source: Series %d: Space required between N and I fields
fi: Sarja %d: N- ja I-kenttien välissä täytyy olla tilaa

source: Series %d: Second '=' missing
fi: Sarja %d: Toinen ’=’-merkki puuttuu

source: Series %d: No room for number before second '='
fi: Sarja %d: Ei tilaa luvulle ennen toista ’=’-merkkiä

source: Series %d: Only a number must be found after first field, right before 2nd '='
fi: Sarja %d: Ensimmäisen kentän jälkeen, juuri ennen toista, täytyy olla luku, ei muuta

source: Series %d: Unknown or doubled field id: %c
fi: Sarja %d: Tuntematon tai kahdennettu kentän tunniste: %c

source: Series %d: Last year exceeds integer range
fi: Sarja %d: Viimeinen vuosi ylittää kokonaislukualueen

source: Series %d (%s): Space required before ID
fi: Sarja %d (%s): Ennen tunnistetta täytyy olla tilaa

source: Series %d (%s): '~' not found in expected location
fi: Sarja %d (%s): ’~’-merkkiä ei löytynyt odotetusta paikasta

source: Series %d: Invalid character in series ID
fi: Sarja %d: Epäkelpo merkki sarjan tunnisteessa

source: Series %d: Alphanumeric series ID not found
fi: Sarja %d: Aakkosnumeerista sarjan tunnistetta ei löytynyt

source: Series %d (%s): Space required after alphanumeric ID
fi: Sarja %d (%s): Aakkosnumeerisen tunnisteen jälkeen täytyy olla tilaa

source: Series %d (%s): Exponent not found
fi: Sarja %d (%s): Eksponenttia ei löytynyt

source: Series %d (%s): Exponent has too many characters
fi: Sarja %d (%s): Eksponentissa on liian monta merkkiä

source: Series %d (%s): Opening parenthesis required after exponent
fi: Sarja %d (%s): Eksponentin jälkeen täytyy olla vasen kaarisulje

source: Series %d (%s): No dot found in number format description
fi: Sarja %d (%s): Lukumuotoilun kuvauksesta ei löytynyt pistettä

source: Series %d (%s): No closing parenthesis found
fi: Sarja %d (%s): Oikeaa kaarisuljetta ei löytynyt

source: Series %d (%s): Number of values per line not found
fi: Sarja %d (%s): Rivillä olevien arvojen lukumäärää ei löytynyt

source: Series %d (%s): At least one value per line is needed
fi: Sarja %d (%s): Tarvitaan vähintään yksi arvo riviä kohti

source: Series %d (%s): Number of values per line (%d) > max line length (%d)
fi: Sarja %d (%s): Rivillä olevien arvojen lukumäärä (%d) > rivin maksimipituus (%d)

source: Series %d (%s): Only 'F' number format is supported
fi: Sarja %d (%s): Vain ’F’-lukumuotoilua tuetaan

source: Series %d (%s): Field width not found
fi: Sarja %d (%s): Kentän leveyttä ei löytynyt

source: Series %d (%s): Field width and '.' must be adjacent
fi: Sarja %d (%s): Kentän leveyden ja ’.’-merkin täytyy olla vierekkäin

source: Series %d (%s): Field width must be at least one (%d seen)
fi: Sarja %d (%s): Kentän leveyden täytyy olla vähintään yksi (%d nähty)

source: Series %d (%s): Number of decimals not found
fi: Sarja %d (%s): Desimaalien lukumäärää ei löytynyt

source: Series %d (%s): Number of decimals and ')' must be adjacent
fi: Sarja %d (%s): Desimaalien lukumäärän ja ’)’-merkin täytyy olla vierekkäin

source: Series %d (%s): No (implied) decimal places allowed in format
fi: Sarja %d (%s): Lukumuotoilussa ei sallita (epäsuoria) desimaaleja

source: Series %d (%s): Required line length %d exceeds the maximum %d
fi: Sarja %d (%s): Tarvittava rivin pituus %d ylittää maksimin %d

source: Series %d (%s): Unexpected end of file (%d data lines read)
fi: Sarja %d (%s): Odottamaton tiedoston lopetus (%d datariviä luettu)

source: Series %d (%s): Data line %d is too long (max length %d)
fi: Sarja %d (%s): Datarivi %d on liian pitkä (maksimipituus %d)

source: Series %d (%s): Could not read number (data row %d, field %d). Malformed number or previous line too long.
fi: Sarja %d (%s): Ei voitu lukea lukua (datarivi %d, kenttä %d). Vääränmuotoinen luku tai edellinen rivi liian pitkä.

source: Error reading file %s
fi: Virhe luettaessa tiedostoa %s

source: No data found in file %s
fi: Tiedostosta %s ei löytynyt dataa

source: all arguments must be integers
fi: kaikkien argumenttien täytyy olla kokonaislukuja

source: 'x' must be a matrix
fi: 'x':n täytyy olla matriisi

source: too many columns in 'x'
fi: 'x':ssä on liian monta saraketta

source: dimensions of 'x', 'series_index' and 'decade' must match
fi: 'x':n, 'series_index'in ja 'decade'n ulottuvuuksien täytyy täsmätä

source: 'series_index' must be positive
fi: 'series_index'in täytyy olla positiivinen

source: Number of years exceeds integer range
fi: Vuosien lukumäärä ylittää kokonaislukualueen

source: no data found in 'x'
fi: 'x':stä ei löytynyt dataa

source: long vectors not supported
fi: pitkiä vektoreita ei tueta

source: length of 'C' must be 1
fi: 'C':n pituuden täytyy olla 1
