Repository: cran/dplR
Catalog: po/R-*.po
Languages: fi

source: 'rwl' must be a data.frame
fi: ’rwl’:n täytyy olla data.frame

source: dimension problem:
fi: dimensio‐ongelma:

source: series ids in 'd2pith' and 'rwl' do not match
fi: sarjojen tunnisteet muuttujissa ’d2pith’ ja ’rwl’ eivät täsmää

source: series ids in 'diam' and 'rwl' do not match
fi: sarjojen tunnisteet muuttujissa ’diam’ ja ’rwl’ eivät täsmää

source: maximum year in (filtered) series: %d
fi: suurin vuosiluku (suodatetussa) sarjassa: %d

source: first bin begins: %d
fi: ensimmäinen kori alkaa: %d

source: cannot fit two segments (not enough years in the series)
fi: ei voi sovittaa kahta segmenttiä (ei tarpeeksi vuosia sarjassa))

source: shorten 'seg.length' or adjust 'bin.floor'
fi: lyhennä segmentin pituutta (’seg.length’) tai säädä ’bin.floor’ia

source: Lag
fi: Viive

source: Correlation
fi: Korrelaatio

source: 'prefix' must be a character string with less than 4 characters
fi: ’prefix’in täytyy olla alle 4‐merkkinen merkkijono

source: 'po' must be a data.frame
fi: ’po’:n täytyy olla data.frame

source: series ids in 'po' and 'rwl' do not match
fi: sarjojen tunnisteet ’po’:ssa ja ’rwl’:ssä eivät täsmää

source: Nothing to combine here. Please supply data.frames formatted according to the data standards in dplR.
fi: Ei mitään yhdistettävää. Ole hyvä ja syötä dplR-datastandardien mukaisia data.frameja.

source: 'rwl' must have numeric columns
fi: ’rwl’:ssä täytyy olla numeric-tyyppiset sarakkeet

source: 'rwl' must have row names
fi: ’rwl’:ssä pitää olla rivinimet

source: row names of 'rwl' must be interpretable as years
fi: 'rwl':n rivinimien täytyy olla tulkittavissa vuosiluvuiksi

source: Year
fi: Vuosi

source: Original: %d series, %d years
fi: Alkuperäinen: %d sarjaa, %d vuotta

source: Common Interval (type='%s'): %d series x %d years = %d
fi: Yhteinen ajanjakso (tyyppi '%s'): %d sarjaa x %d vuotta = %d

source: At least 2 series are needed in 'rwl'
fi: Vähintään 2 sarjaa tarvitaan ’rwl’:ssä

source: At least 1 series is needed in 'rwl'
fi: Vähintään 1 sarja tarvitaan ’rwl’:ssä

source: Segments: length=%d,lag=%d
fi: Segmentit: pituus=%d,viive=%d

source: number of overlapping years is less than 'seg.length'
fi: päällekkäisten vuosien määrä on pienempi kuin ’seg.length’

source: 'crn' must be a data.frame
fi: ’crn’:n täytyy olla data.frame

source: Sample Depth
fi: Näytteiden määrä

source: Verbose output:
fi: Lisätuloste:

source: Options
fi: Valinnat

source: all values are 'NA'
fi: kaikki arvot ovat ’NA’

source: 'NA's are not allowed in the middle of the series
fi: ’NA’‐arvoja ei sallita sarjan keskellä

source: Zero years in input series:
fi: Nollavuodet syötesarjassa:

source: Zero indices in input series:
fi: Nollaindeksit syötesarjassa:

source: No zeros in input series.
fi: Ei nollia syötesarjassa.

source: Detrend by ModNegExp.
fi: Trendin poisto menetelmällä ModNegExp.

source: Trying to fit nls model...
fi: Yritetään sovittaa nls-mallia...

source: nls failed... fitting linear model...
fi: nls epäonnistui... sovitetaan lineaarista mallia...

source: Fits from ModNegExp are not all positive, see constrain.modnegexp argument in detrend.series
fi: ModNegExp-mallin sovite ei ole kokonaan positiivinen, katso constrain.modnegexp-argumentti detrend.series-ohjeessa

source: Linear model fit
fi: Lineaarisen mallin sovite

source: Intercept: %s
fi: Vakiotermi: %s

source: Slope: %s
fi: Kulmakerroin: %s

source: Linear fit (backup of ModNegExp) is not all positive
fi: Lineaarinen sovite (ModNegExp:in varalla) ei ole kokonaan positiivinen

source: lm has a positive slope
fi: lineaarisessa mallissa on positiivinen kulmakerroin

source: Detrend by mean.
fi: Trendin poisto keskiarvolla.

source: Mean = %s
fi: Keskiarvo = %s

source: nls coefs
fi: nls-kertoimet

source: Detrend by spline.
fi: Trendin poisto splinillä.

source: Spline parameters
fi: Splinin parametrit

source: Spline fit is not all positive
fi: Splinisovite is ole kokonaan positiivinen

source: Detrend by prewhitening.
fi: Trendin poisto valkaisemalla (prewhitening).

source: Ar fit is not all positive
fi: Ar-sovite ei ole kokonaan positiivinen

source: Zero years in %s series:
fi: Nollavuodet %s-sarjassa:

source: Zero indices in %s series:
fi: Nollaindeksit %s-sarjassa:

source: Age (Yrs)
fi: Ikä (v)

source: Raw Series %s
fi: Raakasarja %s

source: Spline
fi: Splini

source: RWI
fi: Indeksi

source: Neg. Exp. Curve or Straight Line
fi: Neg. eksp. käyrä tai Suora

source: Horizontal Line (Mean)
fi: Vakiosuora (Keskiarvo)

source: 'y' must be coercible to a numeric vector
fi: ’y’:n täytyy olla muunnettavissa numeric-vektoriksi

source: 'x' must be coercible to a numeric vector
fi: ’x’:n täytyy olla muunnettavissa numeric-vektoriksi

source: there must be at least 3 data points
fi: täytyy olla vähintään 3 datapistettä

source: 'f' must be a number between 0 and 1
fi: ’f’:n täytyy olla numero väliltä 0–1

source: 'nyrs' must be a number greater than 1
fi: ’nyrs’:n täytyy olla numero ja suurempi kuin 1

source: the data abscissae must be distinct
fi: datan abskissojen täytyy olla erilliset

source: abscissa and ordinate vector must be of the same length
fi: abskissa- ja ordinaattavektorien täytyy olla samanpituiset

source: 'x' must be a data.frame
fi: ’x’:n täytyy olla data.frame

source: 'x' must have numeric columns
fi: ’x’:llä täytyy olla numeric-tyyppiset sarakkeet

source: 'fill' must be a single number or character string
fi: ’fill’in täytyy olla yksittäinen numero tai merkkijono

source: Intersection of series %d and %d is not contiguous. NA returned.
fi: Sarjojen %d ja %d leikkaus ei ole katkeamaton. Palautetaan NA.

source: must be TRUE or FALSE: %s
fi: täytyy olla TRUE tai FALSE: %s

source: characters outside a-z, A-Z, 0-9 present: renaming series
fi: mukana merkkejä alueiden a–z, A–Z, 0–9 ulkopuolelta: uudelleennimetään sarjoja

source: some names are too long: renaming series
fi: jotkin nimet ovat liian pitkiä: uudelleennimetään sarjoja

source: duplicate names present: renaming series
fi: duplikaattinimiä läsnä: uudelleennimetään sarjoja

source: could not remap a name: some series will be missing
fi: ei voitu kehittää uutta nimeä: joitain sarjoja puuttuu tuloksesta

source: 'series' not found in 'rwl'
fi: 'series'issä nimettyä sarjaa ei ole ’rwl’:ssä

source: duplicate column names, multiple matches
fi: toistuvia sarakenimiä, useita osumia

source: 'series' of length 1 must be a column index to 'rwl'
fi: yhden elementin 'series'-muuttujan täytyy olla sarakeindeksi 'rwl':ään

source: unknown element(s): %s
fi: tuntematon elementti: %s

source: Detrend series %d of %d
fi: Trendipuhdistetaan sarja %d / %d

source: Choose a detrending method for this series %s.
fi: Valitse trendinpuhdistusmenetelmä tälle sarjalle %s.

source: Methods are:
fi: Menetelmät ovat:

source: Enter a number
fi: Syötä numero

source: number out of range or not an integer
fi: luku alueen ulkopuolella tai ei kokonaisluku

source: input data must have consecutive years in increasing order
fi: syötedatassa täytyy olla peräkkäiset vuodet kasvavassa järjestyksessä

source: invalid 'year': skipping years not allowed
fi: epäkelpo 'year': vuosien väliin jättäminen ei ole sallittua

source: 'year' not present in 'rw.vec.yrs'
fi: 'year' puuttuu 'rw.vec.yrs':stä

source: 'x1' and 'y1' lengths differ
fi: ’x1’:n ja ’y1’:n pituudet eroavat

source: 'x' must be a matrix-like object
fi: ’x’:n täytyy olla matriisin kaltainen

source: 'x' must have at least 2 rows and 2 columns
fi: ’x’:ssä pitää olla vähintään 2 riviä ja saraketta

source: 'x' must contain numeric data
fi: ’x’:n täytyy sisältää numeerisia arvoja

source: use only with "rwl" objects
fi: käytä vain "rwl"-objektien kanssa

source: 'rgv.thresh' must be > 0
fi: ’rgv.thresh’in täytyy olla > 0

source: 'rgv.thresh' > 100 is unusual.
fi: 'rgv.thresh' > 100 on epätavallinen.

source: 'nseries.thresh' must range from 0 to 100
fi: ’nseries.thresh’in täytyy olla välillä 0–100

source: 'rwl' must be coercible to a matrix
fi: ’rwl’:n täytyy olla muunnettavissa matrix-muotoon

source: 'rwl' must have explicit row names
fi: ’rwl’:ssä pitää olla eksplisiittiset rivinimet

source: 'rwl' must have at least 2 rows
fi: ’rwl’:ssä pitää olla vähintään 2 riviä

source: 'seg.length' can be at most 1/2 the number of years in 'rwl'
fi: ’seg.length’ voi olla enintään puolet ’rwl’:n vuosien määrästä

source: 'seg.length' must be even
fi: ’seg.length’in täytyy olla parillinen

source: 'seg.length' and 'seg.lag' must be integers
fi: ’seg.length’in ja ’seg.lag’in täytyy olla kokonaislukuja

source: 'seg.length' must be positive
fi: ’seg.length’in täytyy olla positiivinen

source: 'n' must be an integer
fi: ’n’:n täytyy olla kokonaisluku

source: 'n' must be odd
fi: ’n’:n täytyy olla pariton

source: 'n' must be larger than 3
fi: ’n’:n täytyy olla suurempi kuin 3

source: 'bin.floor' must be a non-negative integer
fi: ’bin.floor’in täytyy olla epänegatiivinen kokonaisluku

source: device does not support raster images
fi: laite ei tue bittikarttakuvia

source: png device unavailable
fi: png-laite ei ole saatavana

source: minimum 'po' is 1
fi: pienin mahdollinen ’po’ on 1

source: each value in 'po' must be an integer
fi: jokaisen ’po’:n arvon täytyy olla kokonaisluku

source: indexing problem when restoring to cal years: first+length(tmp) != last+1
fi: indeksointiongelma vuosilukuja palautettaessa: first+length(tmp) ≠ last+1

source: Cambial Age (Years)
fi: Jälsisolukon ikä (vuotta)

source: Comments:
fi: Kommentit:

source: file is empty
fi: tiedosto on tyhjä

source: first line in the crn file ends before col 10
fi: tiedoston ensimmäinen rivi päättyy ennen saraketta 10

source: There appears to be a header in the crn file
fi: Tiedostossa näyttää olevan otsake

source: There does not appear to be a header in the crn file
fi: Tiedostossa ei näytä olevan otsaketta

source: 'header' must be NULL, TRUE or FALSE
fi: ’header’in täytyy olla NULL, TRUE tai FALSE

source: file has under 4 lines
fi: tiedostossa on alle 4 riviä

source: first data line ends before col 10
fi: ensimmäinen datarivi päättyy ennen saraketta 10

source: cols %d-%d of first data line not a year
fi: ensimmäisen datarivin sarakkeet %d–%d eivät ole vuosiluku

source: Embedded chronology statistics
fi: Sisäänrakennetut kronologian tilastotiedot

source: All embedded sample depths are one...Dumping from matrix
fi: Kaikki sisäänrakennetut näytemäärät ovat yksi...Jätetään pois matriisista

source: file has no data in "Tree" or "Single" formats
fi: tiedostossa ei ole "Tree"- tai "Single"-muotoista dataa

source: invalid file: HEADER and DATA don't match
fi: epäkelpo tiedosto: HEADER- ja DATA-osat eivät sovi yhteen

source: more HEADER blocks than DATA blocks in supported formats
fi: enemmän HEADER-osia kuin tuettuja DATA-osia

source: number of "KeyCode" lines is not 1
fi: "KeyCode"-rivien lukumäärä ei ole 1

source: in series %s:
fi: sarjassa %s:

source: number of "DateBegin" lines is not 1
fi: "DateBegin"-rivien lukumäärä ei ole 1

source: number of "DateEnd" lines is not 1
fi: "DateEnd"-rivien lukumäärä ei ole 1

source: cannot interpret "Unit" line
fi: "Unit"-riviä ei voida tulkita

source: number of "Unit" lines is > 1
fi: "Unit"-rivien lukumäärä on > 1

source: too few values (expected %d, got %d)
fi: liian vähän arvoja (odotettiin %d, saatiin %d)

source: too many values (expected %d, got %d)
fi: liian monta arvoa (odotettiin %d, saatiin %d)

source: Tree and core IDs were found. See attribute "ids".
fi: Puu- ja näytetunnisteet löydettiin. Katso attribuutti "ids".

source: Pith offsets were found (some missing values). See attribute "po".
fi: Sarjojen alusta puuttuvien renkaiden määriä löydettiin. Katso attribuutti "po".

source: Pith offsets were found (no missing values). See attribute "po".
fi: Sarjojen alusta puuttuvien renkaiden määrät löydettiin. Katso attribuutti "po".

source: 'rwl' must have non-NA names
fi: ’rwl’:ssä pitää olla ei-NA-nimet

source: Site-Tree-Core mask must only contain integral values
fi: Paikka–Puu–Näyte‐maskissa täytyy olla pelkkiä kokonaislukuja

source: length of Site-Tree-Core mask must be 3
fi: Paikka–Puu–Näyte‐maskin pituuden täytyy olla 3

source: changed tree-core code "%s" to "%s"
fi: vaihdettiin puu–näyte‐koodi ”%s” koodiksi ”%s”

source: series names must be at least 1 character long
fi: sarjojen nimien täytyy olla vähintään 1 merkin mittaisia

source: %d times:
fi: %d kertaa:

source: changed site code "%s" to "%s"
fi: vaihdettiin paikan koodi ”%s” koodiksi ”%s”

source: uncertain tree-core scheme in %d name ("%s")
fi: epävarma puu–näyte‐kaava %d nimessä (”%s”)

source: uncertain tree-core scheme in %d names ("%s", "%s")
fi: epävarma puu–näyte‐kaava %d nimessä (”%s”, ”%s”)

source: uncertain tree-core scheme in %d names ("%s", ..., "%s")
fi: epävarma puu–näyte‐kaava %d nimessä (”%s”, …, ”%s”)

source: using %d as size of tree part
fi: puuosan pituutena käytössä %d

source: there appears to be more than one site
fi: näyttää olevan useampi kuin yksi kasvupaikka

source: Detected a DPL compact format file.
fi: Tunnistettiin DPL compact ‐tyyppinen tiedosto.

source: Detected a Heidelberg format file.
fi: Tunnistettiin Heidelberg‐tyyppinen tiedosto.

source: Detected a TRiDaS file.
fi: Tunnistettiin TRiDaS‐tiedosto.

source: Assuming a Tucson format file.
fi: Oletetaan Tucson‐tyyppinen tiedosto.

source: in project %d, object %s, element %d, sample %d, radius %d, series %d:
fi: projektissa %d, objektissa %s, elementissä %d, näytteessä %d, säteessä %d, sarjassa %d:

source: lastYear < firstYear
fi: ilmoitettu viimeinen vuosi on aiempi kuin ilmoitettu ensimmäinen vuosi

source: external entities are not supported: %s
fi: ulkoiset entiteetit eivät ole tuettuja: %s

source: unknown entity: %s
fi: tuntematon entiteetti: %s

source: negative missingHeartwoodRingsToPith
fi: negatiivinen missingHeartwoodRingsToPith

source: negative missingSapwoodRingsToPith
fi: negatiivinen missingSapwoodRingsToPith

source: negative nrOfSapwoodRings
fi: negatiivinen nrOfSapwoodRings

source: negative nrOfUnmeasuredInnerRings
fi: negatiivinen nrOfUnmeasuredInnerRings

source: in project %d, derived series %d:
fi: projektissa %d, johdannaissarjassa %d:

source: negative values interpreted as missing
fi: negatiiviset arvot tulkittu puuttuviksi

source: in undated series %d:
fi: ajoittamattomassa sarjassa %d:

source: unitless measurements present
fi: yksiköttömiä mittauksia läsnä

source: strange unit "%s"
fi: outo yksikkö ”%s”

source: negative counts interpreted as missing
fi: negatiiviset lukumäärät tulkittu puuttuviksi

source: in derived series %d:
fi: johdannaissarjassa %d:

source: data from the future
fi: dataa tulevaisuudesta

source: '$measurements' is a data.frame
fi: ’$measurements’ on data.frame

source: there are %d data.frames in the '$measurements' list
fi: ’$measurements’‐listassa on %d data.framea

source: in data.frame %d:
fi: data.framessa %d:

source: data.frame #%d
fi: data.frame nro %d

source: * site:
fi: * paikka:

source: * taxon:
fi: * laji:

source: * variable:
fi: * muuttuja:

source: all rows (last rows excluded) have too few values
fi: kaikki rivit (paitsi sarjojen viimeiset) sisältävät liian vähän arvoja

source: file format problems (or data from the future)
fi: ongelmia tiedostomuodossa (tai dataa tulevaisuudesta)

source: first line in rwl file ends before col 12
fi: tiedoston ensimmäinen rivi päättyy ennen saraketta 12

source: There appears to be a header in the rwl file
fi: Tiedostossa näyttää olevan otsake

source: There does not appear to be a header in the rwl file
fi: Tiedostossa ei näytä olevan otsaketta

source: file has no data
fi: tiedostossa ei ole dataa

source: non-integral numbers found
fi: löydettiin ei‐kokonaislukuja

source: tabs used, assuming non-standard, tab-delimited file
fi: sarkaimia käytetty, oletetaan epästandardi, sarkainerotettu tiedosto

source: fixed width failed, trying variable width columns
fi: kiinteä sarakeleveys epäonnistui, kokeillaan säätyvää leveyttä

source: trying fixed width names, years, variable width data
fi: kokeillaan kiinteän sarakeleveyden nimiä ja vuosia, säätyvän leveyden dataa

source: failed to read rwl file
fi: tiedoston luku epäonnistui

source: series.index must be integer: %s
fi: series.index:in täytyy olla kokonaisluku: %s

source: bad location of stop marker in series %s
fi: epäkelpo loppumerkin sijainti sarjassa %s

source: precision unknown in all series
fi: tuntematon tarkkuus kaikissa sarjoissa

source: combining series %s and %s
fi: yhdistetään sarjat %s ja %s

source: file has no good data
fi: tiedostossa ei ole kelvollista dataa

source: oversampling factor 'ofac' must be >= 1
fi: ylinäytteistyskertoimen 'ofac' täytyy olla >= 1

source: 'hifac' must be positive
fi: ’hifac’in täytyy olla positiivinen

source: if 'mctest' is TRUE, 'nsim' must be at least %.0f
fi: jos 'mctest' on TRUE, 'nsim':in täytyy olla vähintään %.0f

source: numeric 'iwin' must be 0, 1, 2, 3 or 4
fi: numeerisen 'iwin'-arvon täytyy olla 0, 1, 2, 3 tai 4

source: 'iwin' must be numeric or character
fi: ’iwin’in täytyy olla numeerinen tai merkkijonotyyppinen

source: lengths of 't' and 'x' must match
fi: 't':n ja 'x':n pituuksien täytyy täsmätä

source: too few points (%.0f), at least %.0f needed
fi: liian vähän pisteitä (%.0f), vähintään %.0f tarvitaan

source: Duplicate times in 't', averaging data
fi: Toistuvia aikoja 't':ssä, lasketaan keskiarvoja datasta

source: Duplicate ages in 't', averaging data
fi: Toistuvia ikiä 't':ssä, lasketaan keskiarvoja datasta

source: Number of duplicates by time,
fi: Toistuvien arvojen lukumäärä ajan mukaan,

source: Number of duplicates by age,
fi: Toistuvien arvojen lukumäärä iän mukaan,

source: 'k' duplicates means 'k + 1' total observations:
fi: 'k' toistuvaa arvoa tarkoittaa 'k + 1' havaintoa yhteensä:

source: redfitGetrho returned rho = %f, forced to zero
fi: redfitGetrho palautti arvon rho = %f, pakotetaan nollaan

source: use only with "redfit" objects
fi: käytä vain "redfit"-objektien kanssa

source: Input:
fi: Syöte:

source: Initial values:
fi: Alkuarvot:

source: Data variance (from data spectrum) = %s
fi: Datan varianssi (datan spektristä) = %s

source: Avg. dt = %s
fi: Keskimääräinen näytteiden väli (Avg. dt) = %s

source: Results:
fi: Tulokset:

source: Avg. autocorr. coeff., rho = %s
fi: Keskimääräinen autokorrelaatiokerroin rho = %s

source: PRESCRIBED avg. autocorr. coeff., rho = %s
fi: ASETETTU keskimääräinen autokorrelaatiokerroin rho = %s

source: Avg. tau = %s
fi: Keskimääräinen tau = %s

source: Degrees of freedom = %s
fi: Vapausasteet = %s

source: 6-dB Bandwidth = %s
fi: 6 dB:n kaistanleveys = %s

source: Critical false-alarm level (Thomson, 1990) = %s
fi: Kriittinen väärän hälytyksen taso (Thomson, 1990) = %s

source: ==> corresponding scaling factor for red noise = %s
fi: ==> vastaava skaalauskerroin punaiselle kohinalle = %s

source: Equality of theoretical and data spectrum: Runs test
fi: Teoreettisen ja datan spektrin sopivuus: Pätkätesti (runs test)

source: %s-%% acceptance region:
fi: %s %%:n hyväksymisalue:

source: Test requires iwin = 0
fi: Testi vaatii iwin = 0

source: Test requires ofac = 1
fi: Testi vaatii ofac = 1

source: Test requires n50 = 1
fi: Testi vaatii n50 = 1

source: Data Columns:
fi: Datan Sarakkeet:

source: 1: Freq = frequency
fi: 1: Freq = taajuus

source: 2: Gxx = spectrum of input data
fi: 2: Gxx = syötedatan spektri

source: 3: Gxx_corr = bias-corrected spectrum of input data
fi: 3: Gxx_corr = syötedatan harhakorjattu spektri

source: 4: Gred_th = theoretical AR(1) spectrum
fi: 4: Gred_th = teoreettinen AR(1)-spektri

source: 5: Gred_avg = average spectrum of Nsim AR(1) time series (uncorrected)
fi: 5: Gred_avg = keskiarvospektri Nsim AR(1)-aikasarjasta (korjaamaton)

source: %.0f: Chi2_%.0fpct = %.0f%% false-alarm level (Chi^2)
fi: %.0f: Chi2_%.0fpct = %.0f %%:n väärän hälytyksen taso (Chi^2)

source: %.0f: MC_%.0fpct = %.0f%% false-alarm level (MC)
fi: %.0f: MC_%.0fpct = %.0f %%:n väärän hälytyksen taso (Markov-ketju)

source: timelimit exceeded
fi: aikaraja ylitetty

source: too few points per segment (%.0f), at least %.0f needed
fi: liian vähän pisteitä per segmentti (%.0f), vähintään %.0f tarvitaan

source: too many segments: overlap of more than nseg - 1 points
fi: liian monta segmenttiä: päällekkäisyys enemmän kuin nseg - 1 pistettä

source: rho estimation: <= 0
fi: rho:n estimointi: <= 0

source: rho estimation: > 1
fi: rho:n estimointi: > 1

source: estimation problem: LS function has > 1 minima
fi: estimointiongelma: pienimmän neliösumman funktiolla on > 1 minimi

source: estimation problem: a_min =< 0
fi: estimointiongelma: a_min =< 0

source: estimation problem: a_min >= 1
fi: estimointiongelma: a_min >= 1

source: error in tau estimation
fi: virhe tau:n estimoinnissa

source: 'ids' must have numeric columns
fi: ’ids’:llä täytyy olla numeric-tyyppiset sarakkeet

source: Correlations are all NA. No overlap in series?
fi: Kaikki korrelaatiot ovat NA. Sarjoissa ei päällekkäisyyttä?

source: minimum 'window.length' is 3
fi: pienin mahdollinen ’window.length’ on 3

source: 'window.overlap' is too large, max value is 'window.length'-1 (%d)
fi: ’window.overlap’ on liian suuri, maksimiarvo on ’window.length’−1 (%d)

source: 'window.length' is smaller than 'min.corr.overlap'
fi: ’window.length’ on pienempi kuin ’min.corr.overlap’

source: after prewhitening, 'rwi' contains column(s) without at least four observations
fi: valkaisun jälkeen ’rwi’ sisältää ainakin yhden sarakkeen, jossa on vähemmän kuin 4 havaintoa

source: note that there is no error checking on column lengths if filtering is not performed
fi: huomaa että sarakkeiden pituuksia ei tarkisteta, jos suodatus jätetään pois

source: There are zeros in the data. Consider the option 'zero.is.missing'.
fi: Datassa on nollia. Harkitse asetusta ’zero.is.missing’.

source: 'ids' must be a data.frame with columns 'tree' and 'core'
fi: ’ids’:n täytyy olla data.frame, jossa on sarakkeet ’tree’ ja ’core’

source: Series with matching tree/core IDs have been averaged
fi: Samoilla puu- ja näytetunnisteilla varustetut sarjat on keskiarvoistettu

source: 'window.length' is larger than the number of years in 'rwi'
fi: ’window.length’ on suurempi kuin vuosien määrä ’rwi’:ssä

source: at least 2 trees are needed
fi: ainakin 2 puuta tarvitaan

source: too few years with enough trees for correlation calculations
fi: liian vähän vuosia joissa olisi riittävästi puita korrelaation laskemiseen

source: 'first.start' too small, must be >= 1
fi: ’first.start’ liian pieni, täytyy olla ≥ 1

source: 'first.start' too large
fi: ’first.start’ liian suuri

source: 'x' must have at least one column
fi: ’x’:ssä pitää olla vähintään yksi sarake

source: 'x' must have non-automatic row.names
fi: ’x’:ssä pitää olla ei-automaattiset rivinimet

source: NA result at position %d.
fi: NA-tulos paikassa %d.

source: You could check whether 'key' years are in range.
fi: Voisit tarkastaa ovatko ’key’-vuodet alueen sisällä.

source: Exact p-value (< %f) could not be estimated for superposed epoch at position %d.
fi: Tarkkaa p-arvoa (< %f) ei voitu estimoida päällekkäiselle aikakaudelle paikassa %d.

source: You could try a higher value for 'resample'.
fi: Voisit kokeilla korkeampaa arvoa muuttujalle ’resample’.

source: Detrended Series
fi: Trendipuhdistettu sarja

source: Detrended Master
fi: Trendipuhdistettu pääsarja

source: Master
fi: Pääsarja

source: Series
fi: Sarja

source: Segments: length=%d,lag=%d,bin.floor=%d
fi: Segmentit: pituus=%d,viive=%d,lattia=%d

source: Series:%d-%d
fi: Sarja:%d–%d

source: Master:%d-%d
fi: Pääsarja:%d–%d

source: Detrended and Trimmed:
fi: Trendipuhdistettu ja siistitty:

source: Detrending Options:
fi: Trendinpuhdistusvaihtoehdot:

source: 'sname' must be a character string whose width is less than 8
fi: ’sname’n täytyy olla merkkijono jonka leveys on alle 8
