Repository: cran/dplR
Catalog: po/R-*.po
Languages: fi

source: input series has length of %d
fi: syötesarjan pituus on %d

source: long series (> 840) must be split into multiple plots
fi: pitkät sarjat (> 840) täytyy jakaa moneen kuvaan

source: 'filt.weight' is %f
fi: ’filt.weight’ on %f

source: 'filt.weight' must not be larger than length of input series
fi: ’filt.weight’ ei saa olla suurempi kuin syötesarjan pituus

source: empty 'rwl' given, nothing to draw
fi: tyhjä ’rwl’ annettu, ei mitään piirrettävää

source: reverting to useRaster=FALSE
fi: palataan asetukseen useRaster=FALSE

source: 'rwl' must have unique, non-NA names
fi: ’rwl’:ssä pitää olla uniikit, ei-NA-nimet

source: 'ids' must be NULL or a data.frame
fi: ’ids’:n täytyy olla NULL tai data.frame

source: 'ids' must be a data.frame with column 'tree'
fi: ’ids’:n täytyy olla data.frame jossa on sarake ’tree’

source: missing tree IDs are not allowed
fi: puuttuvia puutunnisteita ei sallita

source: a user-coded (pseudo) random number generator is in use
fi: käyttäjän tekemä (pseudo)satunnaislukugeneraattori on käytössä

source: Time
fi: Aika

source: Period
fi: Jakso

source: Power
fi: Teho

source: 'wave.list$x' and 'wave.list$period' must be strictly ascending
fi: ’wave.list$x’:n ja ’wave.list$period’in täytyy olla aidosti nousevat

source: 'wave.list$period' must be positive
fi: ’wave.list$period’in täytyy olla positiivinen

source: 'rwl.df' must be a data.frame
fi: ’rwl.df’:n täytyy olla data.frame

source: 'prec' must equal 0.01 or 0.001
fi: ’prec’in täytyy olla 0.01 tai 0.002

source: file %s does not exist, cannot append
fi: tiedostoa %s ei ole olemassa, ei voi lisätä loppuun

source: series %s: header line would be too long
fi: sarja %s: otsikkorivi olisi liian pitkä

source: 'crn' must have 2 columns
fi: ’crn’:ssä täytyy olla 2 saraketta

source: bad idea to append with 'header'
fi: huono ajatus lisätä loppuun kun on annettu ’header’

source: header must be a list
fi: ’header’in täytyy olla list-tyyppinen muuttuja

source: 'header' must be a list with the following names:
fi: ’header’in täytyy olla list-tyyppinen muuttuja jossa on seuraavat nimet:

source: 'lab.info' must be a data.frame with at least one row
fi: ’lab.info’n täytyy olla vähintään yksirivinen data.frame

source: "name" is a required variable in 'lab.info'
fi: ”name” on pakollinen muuttuja ’lab.info’ssa

source: "domain" is required together with "identifier" in 'lab.info'
fi: ”domain” vaaditaan yhdessä ”identifier”in kanssa ’lab.info’ssa

source: "identifier" is a required variable in 'research.info'
fi: ”identifier” on pakollinen muuttuja ’research.info’ssa

source: "domain" is a required variable in 'research.info'
fi: ”domain” on pakollinen muuttuja ’research.info’ssa

source: "description" is a required variable in 'research.info'
fi: ”description” on pakollinen muuttuja ’research.info’ssa

source: '%s' must be of type character - inserting "%s"
fi: ’%s’:n täytyy olla character-tyyppinen – asetetaan arvo ”%s”

source: '%s' must be a list. Creating one.
fi: ’%s’:n täytyy olla list-tyyppinen muuttuja. Luodaan sellainen.

source: '%s$%s' must be of type character - inserting "%s"
fi: ’%s$%s’:n täytyy olla character-tyyppinen – asetetaan arvo ”%s”

source: 2-col 'ids' needs "tree" and "core" columns
fi: 2-sarakkeisessa ’ids’-muuttujassa täytyy olla ”tree”- ja ”core”-sarakkeet

source: 3-col 'ids' needs "tree", "core", and "radius" columns
fi: 3-sarakkeisessa ’ids’-muuttujassa täytyy olla ”tree”-, ”core”- ja ”radius”-sarakkeet

source: 4-col 'ids' needs "tree", "core", "radius", and "measurement" columns
fi: 4-sarakkeisessa ’ids’-muuttujassa täytyy olla ”tree”-, ”core”-, ”radius”- ja ”measurement”-sarakkeet

source: argument 'ids' is in wrong format (2, 3, or 4 columns required)
fi: argumentti ’ids’ on vääränmuotoinen (vaaditaan 2, 3 tai 4 saraketta)

source: argument 'ids' is not data.frame or has wrong number of rows
fi: argumentti ’ids’ ei ole data.frame tai sillä on väärä rivimäärä

source: columns needed in 'titles': "tree", "core", "radius", and "measurement"
fi: sarakkeet jotka tarvitaan ’titles’issa: ”tree”, ”core”, ”radius” ja ”measurement”

source: argument 'titles' is not data.frame or has wrong number of rows
fi: argumentti ’titles’ ei ole data.frame tai sillä on väärä rivimäärä

source: 'ids' and 'titles' not consistent or duplicates present
fi: ’ids’ ja ’titles’ eivät ole yhtäpitävät tai on olemassa duplikaatteja

source: unknown 'prec' specified: no unit conversion or rounding done
fi: tuntematon ’prec’ annettu: yksikköjen muunnosta tai

source: 'nrow(wood.completeness)' must be equal to 'ncol(rwl.df)'
fi: ’nrow(wood.completeness)’in täytyy olla sama kuin ’ncol(rwl.df)’

source: row names of 'wood.completeness' must match column names of 'rwl.df'
fi: ’wood.completeness’in rivien ja ’rwl.df’:n sarakkeiden nimien täytyy täsmätä

source: some values in 'wood.completeness$%s' are invalid, i.e. not integer or < 0
fi: jotkin arvot muuttujassa ’wood.completeness$%s’ ovat epäkelpoja, eli eivät kokonaislukuja tai < 0

source: 'header' must be a list
fi: ’header’in täytyy olla list-tyyppiä

source: years earlier than -9999 (10000 BC) are not supported
fi: vuosia ennen -9999 (10000 eaa.) ei tueta

source: years later than 99999 are not possible
fi: 99999:n jälkeiset vuodet eivät ole mahdollisia

source: 'win.width' must be even
fi: ’win.width’in täytyy olla parillinen

source: win.width should be < 100 unless your plotting is very wide!
fi: win.width:in pitäisi olla < 100 ellei kuva ole hyvin leveä!

source: Fix window overlap
fi: Korjaa ikkunoiden päällekkäisyys

source: (Negative)
fi: (Negatiivinen)

source: (Positive)
fi: (Positiivinen)

source: Period: %d-%d
fi: Jakso: %d–%d

source: Skeleton Agreement %s%%
fi: Yhteensopivuus %s%%

source: These plots get crowded with windows longer than 100 years.
fi: Kuvista tulee ahtaita jos ikkunat ovat pidempiä kuin 100 vuotta

source: Window Years: %d-%d
fi: Ikkunan vuodet: %d–%d

source: Series Years: %d-%d
fi: Sarjan vuodet: %d–%d

source: Master Years: %d-%d
fi: Pääsarjan vuodet: %d–%d

source: There is %d series
fi: On %d sarja

source: There is %d undated series, returned in '$undated'
fi: On %d ajoittamaton sarja, joka palautetaan muuttujassa ’$undated’

source: There is %d derived series, returned in '$derived'
fi: On %d johdannaissarja, joka palautetaan muuttujassa ’$derived’

source: %d row has too many values (ID, decade %s)
fi: %d rivissä on liian monta arvoa (ID, vuosikymmen %s)

source: overlap in %d pair of ID, year: %s
fi: päällekkäisyyttä %d ID, vuosi -parissa: %s

source: precision unknown in series %s
fi: tuntematon tarkkuus sarjassa %s

source: %.0f NA value removed
fi: %.0f NA-arvo poistettu
